MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA4L1BB4CFM/mcu.h
        struct
        {
            __IOM uint32_t NONSEC0  : 1; /*!< [0..0] Non Secure Attribute bit 0                                         */
            __IOM uint32_t NONSEC1  : 1; /*!< [1..1] Non Secure Attribute bit 1                                         */
            uint32_t                : 6;
            __IOM uint32_t NONSEC8  : 1; /*!< [8..8] Non Secure Attribute bit 8                                         */
            __IOM uint32_t NONSEC9  : 1; /*!< [9..9] Non Secure Attribute bit 9                                         */
            __IOM uint32_t NONSEC10 : 1; /*!< [10..10] Non Secure Attribute bit 10                                      */
            uint32_t                : 21;
        } LVDSAR_b;
    };
    __IM uint32_t RESERVED55[11];
    __IM uint16_t RESERVED56;

    union
    {
        __IOM uint16_t PRCR;           /*!< (@ 0x000003FE) Protect Register                                           */

        struct
        {
            __IOM uint16_t PRC0 : 1;   /*!< [0..0] Enables writing to the registers related to the clock
                                        *   generation circuit.                                                       */
            __IOM uint16_t PRC1 : 1;   /*!< [1..1] Enables writing to the registers related to the operating
                                        *   modes, the low power consumption modes and the battery
                                        *   backup function.                                                          */
            uint16_t            : 1;
            __IOM uint16_t PRC3 : 1;   /*!< [3..3] Enables writing to the registers related to the LVD.               */
            __IOM uint16_t PRC4 : 1;   /*!< [4..4] PRC4                                                               */
            uint16_t            : 3;
            __OM uint16_t PRKEY : 8;   /*!< [15..8] PRKEY Key Code                                                    */
        } PRCR_b;
    };
    __IM uint32_t RESERVED57[3];
    __IM uint16_t RESERVED58;

    union
    {
        __IOM uint8_t SYOCDCR;         /*!< (@ 0x0000040E) System Control OCD Control Register                        */

        struct
        {
            uint8_t             : 7;
            __IOM uint8_t DBGEN : 1;   /*!< [7..7] Debugger Enable bit                                                */
        } SYOCDCR_b;
    };
    __IM uint8_t RESERVED59;

    union
    {
        __IOM uint8_t RSTSR0;          /*!< (@ 0x00000410) Reset Status Register 0                                    */

        struct
        {
            __IOM uint8_t PORF : 1;    /*!< [0..0] Power-On Reset Detect FlagNOTE: Writable only to clear
                                        *   the flag. Confirm the value is 1 and then write 0.                        */
            __IOM uint8_t LVD0RF : 1;  /*!< [1..1] Voltage Monitor 0 Reset Detect FlagNOTE: Writable only
                                        *   to clear the flag. Confirm the value is 1 and then write
                                        *   0.                                                                        */
            __IOM uint8_t LVD1RF : 1;  /*!< [2..2] Voltage Monitor 1 Reset Detect FlagNOTE: Writable only
                                        *   to clear the flag. Confirm the value is 1 and then write
                                        *   0.                                                                        */
            __IOM uint8_t LVD2RF : 1;  /*!< [3..3] Voltage Monitor 2 Reset Detect FlagNOTE: Writable only
                                        *   to clear the flag. Confirm the value is 1 and then write
                                        *   0.                                                                        */
            uint8_t : 4;
        } RSTSR0_b;
    };

    union
    {
        __IOM uint8_t RSTSR2;          /*!< (@ 0x00000411) Reset Status Register 2                                    */

        struct
        {
            __IOM uint8_t CWSF : 1;    /*!< [0..0] Cold/Warm Start Determination Flag                                 */
            uint8_t            : 7;
        } RSTSR2_b;
    };
    __IM uint8_t RESERVED60;

    union
    {
        __IOM uint8_t MOMCR;           /*!< (@ 0x00000413) Main Clock Oscillator Mode Oscillation Control
                                        *                  Register                                                   */

        struct
        {
            uint8_t              : 3;
            __IOM uint8_t MODRV1 : 1;  /*!< [3..3] Main Clock Oscillator Drive Capability 1 Switching                 */
            uint8_t              : 2;
            __IOM uint8_t MOSEL  : 1;  /*!< [6..6] Main Clock Oscillator Switching                                    */
            uint8_t              : 1;
        } MOMCR_b;
    };
    __IM uint16_t RESERVED61;
    __IM uint8_t  RESERVED62;

    union
    {
        union
        {
            __IOM uint8_t LVCMPCR;     /*!< (@ 0x00000417) Voltage Monitor Circuit Control Register                   */

            struct
            {
                uint8_t             : 5;
                __IOM uint8_t LVD1E : 1; /*!< [5..5] Voltage Detection 1 Enable                                         */
                __IOM uint8_t LVD2E : 1; /*!< [6..6] Voltage Detection 2 Enable                                         */
                uint8_t             : 1;
            } LVCMPCR_b;
        };

        union
        {
            __IOM uint8_t LVD1CMPCR;      /*!< (@ 0x00000417) Voltage Monitoring 1 Comparator Control Register           */

            struct
            {
                __IOM uint8_t LVDLVL : 4; /*!< [3..0] Voltage Detection 1 Level Select (Standard voltage during
                                           *   drop in voltage)                                                          */
                uint8_t            : 3;
                __IOM uint8_t LVDE : 1;   /*!< [7..7] Voltage Detection 1 Enable                                         */
            } LVD1CMPCR_b;
        };
    };

    union
    {
        __IOM uint8_t LVD2CMPCR;         /*!< (@ 0x00000418) Voltage Monitoring 2 Comparator Control Register           */

        struct
        {
            __IOM uint8_t LVDLVL : 3;    /*!< [2..0] Voltage Detection 2 Level Select (Standard voltage during
                                          *   drop in voltage)                                                          */
            uint8_t                 : 3;
            __IOM uint8_t EXVCCINP2 : 1; /*!< [6..6] Voltage Detection 2 Comparison (Voltage external input
                                          *   select)                                                                   */
            __IOM uint8_t LVDE : 1;      /*!< [7..7] Voltage Detection 2 Enable                                         */
        } LVD2CMPCR_b;
    };
    __IM uint8_t RESERVED63;

    union
    {
        __IOM uint8_t LVD1CR0;         /*!< (@ 0x0000041A) Voltage Monitor 1 Circuit Control Register 0               */

        struct
        {
            __IOM uint8_t RIE  : 1;    /*!< [0..0] Voltage Monitor Interrupt/Reset Enable                             */
            uint8_t            : 1;
            __IOM uint8_t CMPE : 1;    /*!< [2..2] Voltage Monitor Circuit Comparison Result Output Enable            */
            uint8_t            : 3;
            __IOM uint8_t RI   : 1;    /*!< [6..6] Voltage Monitor Circuit Mode Select                                */
            __IOM uint8_t RN   : 1;    /*!< [7..7] Voltage Monitor Reset Negate Select                                */
        } LVD1CR0_b;
    };

    union
    {
        __IOM uint8_t LVD2CR0;         /*!< (@ 0x0000041B) Voltage Monitor 2 Circuit Control Register 0               */

        struct
        {
            __IOM uint8_t RIE  : 1;    /*!< [0..0] Voltage Monitor Interrupt/Reset Enable                             */
            uint8_t            : 1;
            __IOM uint8_t CMPE : 1;    /*!< [2..2] Voltage Monitor Circuit Comparison Result Output Enable            */
            uint8_t            : 3;
            __IOM uint8_t RI   : 1;    /*!< [6..6] Voltage Monitor Circuit Mode Select                                */
            __IOM uint8_t RN   : 1;    /*!< [7..7] Voltage Monitor Reset Negate Select                                */
        } LVD2CR0_b;
    };
    __IM uint32_t RESERVED64[25];

    union
    {
        __IOM uint8_t SOSCCR;          /*!< (@ 0x00000480) Sub-Clock Oscillator Control Register                      */

        struct
        {
            __IOM uint8_t SOSTP : 1;   /*!< [0..0] Sub-Clock Oscillator Stop                                          */
            uint8_t             : 7;
        } SOSCCR_b;
    };

    union
    {
        __IOM uint8_t SOMCR;           /*!< (@ 0x00000481) Sub Clock Oscillator Mode Control Register                 */

        struct
        {
            __IOM uint8_t SODRV  : 2;  /*!< [1..0] Sub-Clock Oscillator Drive Capability Switching                    */
            uint8_t              : 2;
            __IOM uint8_t EXCLKS : 1;  /*!< [4..4] Sub Clock Oscillator Mode Function Switching                       */
            uint8_t              : 3;
        } SOMCR_b;
    };

    union
    {
        __IOM uint8_t SOMRG;           /*!< (@ 0x00000482) Sub Clock Oscillator Margin Check Register                 */

        struct
        {
            __IOM uint8_t SOSCMRG : 2; /*!< [1..0] Sub Clock Oscillator Margin check Switching                        */
            uint8_t               : 6;
        } SOMRG_b;
    };
    __IM uint8_t  RESERVED65;
    __IM uint32_t RESERVED66[3];

    union
    {
        __IOM uint8_t LOCOCR;          /*!< (@ 0x00000490) Low-Speed On-Chip Oscillator Control Register              */

        struct
        {
            __IOM uint8_t LCSTP : 1;   /*!< [0..0] LOCO Stop                                                          */
            uint8_t             : 7;
        } LOCOCR_b;
    };
    __IM uint8_t RESERVED67;

    union
    {
        __IOM uint8_t LOCOUTCR;         /*!< (@ 0x00000492) LOCO User Trimming Control Register                        */

        struct
        {
            __IOM uint8_t LOCOUTRM : 8; /*!< [7..0] LOCO User Trimming 1000_0000 : -128 1000_0001 : -127
                                         *   1000_0010 : -126 . . . 1111_1111 : -1 0000_0000 : Center
                                         *   Code 0000_0001 : +1 . . . 0111_1101 : +125 0111_1110 :
                                         +126 0111_1111 : +127These bits are added to original LOCO
                                         *   trimming bits                                                             */
        } LOCOUTCR_b;
    };
    __IM uint8_t  RESERVED68;
    __IM uint32_t RESERVED69[11];

    union
    {
        __IOM uint8_t VBTLVDCR;        /*!< (@ 0x000004C0) EXLVDVBAT Circuit Control Register                         */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] EXLVDVBAT Pin Low Voltage Detect Enable                            */
            __IOM uint8_t LVL  : 3;    /*!< [7..5] EXLVDVBAT Pin Low Voltage Detect Level Select                      */
        } VBTLVDCR_b;
    };

    union
    {
        __IOM uint8_t VBTLVDSR;        /*!< (@ 0x000004C1) EXLVDVBAT Circuit Status Register                          */

        struct
        {
            uint8_t           : 1;
            __IOM uint8_t DET : 1;     /*!< [1..1] EXLVDVBAT Pin Low Voltage Detect Flag                              */
            uint8_t           : 3;
            __IM uint8_t MON  : 1;     /*!< [5..5] EXLVDVBAT Pin Low Voltage Monitor Flag                             */
            uint8_t           : 2;
        } VBTLVDSR_b;
    };

    union
    {
        __IOM uint8_t VBTCMPCR;        /*!< (@ 0x000004C2) EXLVDVBAT Comparator Control Register                      */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] EXLVDVBAT Pin Low Voltage Detect Circuit Output Enable             */
            uint8_t            : 7;
        } VBTCMPCR_b;
    };

    union
    {
        __IOM uint8_t VBTLVDICR;       /*!< (@ 0x000004C3) EXLVDVBAT Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] EXLVDVBAT Pin Low Voltage Detect Interrupt Enable                  */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] EXLVDVBAT Pin Low Voltage Detect Interrupt Generation
                                        *   Condition Select                                                          */
            uint8_t : 2;
        } VBTLVDICR_b;
    };

    union
    {
        __IOM uint8_t VRTLVDCR;        /*!< (@ 0x000004C4) LVDVRTC Circuit Control Register                           */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] VRTC Pin Low Voltage Detect Enable                                 */
            __IOM uint8_t LVL  : 3;    /*!< [7..5] VRTC Pin Low Voltage Detect Level Select                           */
        } VRTLVDCR_b;
    };

    union
    {
        __IOM uint8_t VRTSR;           /*!< (@ 0x000004C5) VRTC Status Register                                       */

        struct
        {
            __IOM uint8_t PORDET : 1;  /*!< [0..0] VRTC-domain Power-on Reset Detect Flag                             */
            __IOM uint8_t DET    : 1;  /*!< [1..1] VRTC Voltage Variation Detection Flag                              */
            uint8_t              : 2;
            __IM uint8_t VRTVLD  : 1;  /*!< [4..4] VRTC-domain Valid                                                  */
            __IM uint8_t MON     : 1;  /*!< [5..5] VRTC Signal Monitor Flag                                           */
            uint8_t              : 2;
        } VRTSR_b;
    };

    union
    {
        __IOM uint8_t VRTCMPCR;        /*!< (@ 0x000004C6) VRTC Comparator Control Register                           */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] VRTC Pin Low Voltage Detect Circuit Output Enable                  */
            uint8_t            : 7;
        } VRTCMPCR_b;
    };

    union
    {
        __IOM uint8_t VRTLVDICR;       /*!< (@ 0x000004C7) VRTC Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] VRTC Pin Low Voltage Detect Interrupt Enable                       */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] VRTC Pin Low Voltage Detect Interrupt Generation Condition
                                        *   Select                                                                    */
            uint8_t : 2;
        } VRTLVDICR_b;
    };

    union
    {
        __IOM uint8_t EXLVDCR;         /*!< (@ 0x000004C8) EXLVD Circuit Control Register                             */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] EXLVD Pin Low Voltage Detect Enable                                */
            uint8_t            : 3;
        } EXLVDCR_b;
    };

    union
    {
        __IOM uint8_t EXLVDSR;         /*!< (@ 0x000004C9) EXLVD Circuit Status Register                              */

        struct
        {
            uint8_t           : 1;
            __IOM uint8_t DET : 1;     /*!< [1..1] EXLVD pin Low Voltage Detect Flag                                  */
            uint8_t           : 3;
            __IM uint8_t MON  : 1;     /*!< [5..5] EXLVD pin Low Voltage Monitor Flag                                 */
            uint8_t           : 2;
        } EXLVDSR_b;
    };

    union
    {
        __IOM uint8_t EXLVDCMPCR;      /*!< (@ 0x000004CA) EXLVD Comparator Control Register                          */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] EXLVD Pin Low Voltage Detect Circuit Output Enable                 */
            uint8_t            : 7;
        } EXLVDCMPCR_b;
    };

    union
    {
        __IOM uint8_t EXLVDICR;        /*!< (@ 0x000004CB) EXLVD Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] EXLVD Pin Low Voltage Detect Interrupt Enable                      */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] EXLVD Pin Low Voltage Detect Interrupt Generation Condition
                                        *   Select                                                                    */
            uint8_t : 2;
        } EXLVDICR_b;
    };
} R_SYSTEM_Type;                       /*!< Size = 1228 (0x4cc)                                                       */

/* =========================================================================================================================== */
/* ================                                           R_TSN                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Temperature Sensor (R_TSN)
 */

